Yourigh/A_light/3 - FW SW/2 - Alarm Clock FW ESP8266/_190104_ESP8266_Alight_gitted/src/Alight_main.cpp
        PRINTDEBUG("\nclearing eeprom 0 - 127 index");
        for (unsigned int i = 0; i < 127; ++i) {
          EEPROM.write(i, 0);
        }
        PRINTDEBUG("\neeprom cleared");
        delay(5);
        PRINTDEBUG("\nwriting eeprom ssid:");
        for (byte i = 0; i < qsid.length(); ++i)
        {
          EEPROM.write(i, qsid[i]);
          PRINTDEBUG(qsid[i]);
        }
        PRINTDEBUG("\nwriting eeprom pass:");
        for (byte i = 0; i < qpass.length(); ++i)
        {
          EEPROM.write(32 + i, qpass[i]);
          PRINTDEBUG(qpass[i]);
        }
        EEPROM.commit();
        //message stating credentials saved with restart button
        s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>Local WiFi credentials saved!<br><br><a href=\"";
        s += "restart";
        s += "\"><button>Restart!</button></a>";
        s += "<p></p></html>\r\n\r\n";
        LED_blink_all(leds,2,CRGB::Green); 
      }
    }
    else if ( req.startsWith("/cleareeprom") ) {
      s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>EEPROM cleared!<br><br><a href=\"";
      s += "restart";
      s += "\"><button>Restart!</button></a>";
      s += "<p></p></html>\r\n\r\n";
      PRINTDEBUG("\nSending 200");
      PRINTDEBUG("\nclearing eeprom");
      for (int i = 0; i < 512; ++i) {
        EEPROM.write(i, 0);
      }
      EEPROM.commit();
      LED_blink_all(leds,1,CRGB::Green);
    }
    else if (req.startsWith("/a?update="))
    {
      http_update_handle(req);
    }
    else if ( req.startsWith("/restart") ) {
      s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>A_light";
      s += "<p>Restarting...<p>";
      s += "</html>\r\n\r\n";
      PRINTDEBUG("\nSending 200");
      PRINTDEBUG("\nRestarting");
      client.print(s); //because it won't run in the end of this IF statements
      if (WiFi.status() == WL_CONNECTED)  WiFi.disconnect();
      delay(100);
      LED_blink_all(leds,1,CRGB::Yellow);
      program_restart();
    }
    else if ( req.startsWith("/wifioff")) {
      s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>A_light";
      s += "<p>Wifi Turning off, no wireless in summer mode, restart for connection...<p>";
      s += "</html>\r\n\r\n";
      PRINTDEBUG("\nSending 200");
      PRINTDEBUG("\nWifi off");
      client.print(s); //because it won't run in the end of this IF statements
      if (WiFi.status() == WL_CONNECTED)  WiFi.disconnect();
      WiFi.mode( WIFI_OFF );
      WiFi.forceSleepBegin();
      delay(100);
      LED_blink_all(leds,1,CRGB::Green);
      summer_mode=true;
    }
    else
    {
      s = "HTTP/1.1 404 Not Found\r\n\r\n";
      PRINTDEBUG("\nSending 404");
      LED_blink_all(leds,1,CRGB::Red);  //get rid of this maybe, because browser asks for an icon every load and it is error
    }
  }
  else //web type 0 is when connected to local wifi
  {
    if (req == "/")
    {     
      s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>A-Light active<br><a href=\"";
      s += "summertime_on\">Turn on summer time (UTC+2)</a><br><a href=\"";
      s += "summertime_off\">Turn off summer time (UTC+1)</a><br><a href=\"";
      s += "restart\">Device restart</a><br><a href=\"";
      s += "wifioff\">Summer mode (no WiFi untul restart)</a><br><a href=\"";
      s += "cleareeprom\">Clear eeprom - remove all settings!</a><br>";
      s += "<p>";
      s += "</html>\r\n\r\n";
      PRINTDEBUG("\nSending 200");
      LED_blink_all(leds,1,CRGB::Blue);
    }
    else if ( req.startsWith("/cleareeprom") ) {
      s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>EEPROM cleared!<br><br><a href=\"";
      s += "restart";
      s += "\"><button>Restart!</button></a>";
      s += "<p></p></html>\r\n\r\n";
      PRINTDEBUG("\nSending 200");
      PRINTDEBUG("\nClearing eeprom");
      for (int i = 0; i < 512; ++i) {
        EEPROM.write(i, 0);
      }
      EEPROM.commit();
      LED_blink_all(leds,1,CRGB::Green);
    }
    else if ( req.startsWith("/restart") ) {
      s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>A_light";
      s += "<p>Restarting...<p>";
      s += "</html>\r\n\r\n";
      PRINTDEBUG("\nSending 200");
      PRINTDEBUG("\nRestarting");
      client.print(s); //because it won't run in the end of this IF statements
      if (WiFi.status() == WL_CONNECTED)  WiFi.disconnect();
      delay(100);
      LED_blink_all(leds,1,CRGB::Yellow);
      program_restart();
    }
    else if ( req.startsWith("/wifioff")) {
      s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>A_light";
      s += "<p>Wifi Turning off, no wireless in summer mode, restart for connection...<p>";
      s += "</html>\r\n\r\n";
      PRINTDEBUG("\nSending 200");
      PRINTDEBUG("\nWifi off");
      client.print(s); //because it won't run in the end of this IF statements
      if (WiFi.status() == WL_CONNECTED)  WiFi.disconnect();
      WiFi.mode( WIFI_OFF );
      WiFi.forceSleepBegin();
      delay(100);
      LED_blink_all(leds,1,CRGB::Green);
      summer_mode=true;
    }
    else if ( req.startsWith("/summertime_on") ) {
      timeClient.setTimeOffset(7200);
      setSyncInterval(5); 
      EEPROM.write(SUMMERTIME_MEMORY_OFFSET, 0b1);
      EEPROM.commit();
      s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>UTC+2 selected<br>";
      s += "<p>";
      s += "</html>\r\n\r\n";
      PRINTDEBUG("\nSending 200");
      LED_blink_all(leds,1,CRGB::Purple);
    }
    else if ( req.startsWith("/summertime_off") ) {
      timeClient.setTimeOffset(3600);
      setSyncInterval(5); 
      EEPROM.write(SUMMERTIME_MEMORY_OFFSET, 0b0);
      EEPROM.commit();
      s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>UTC+1 selected<br>";
      s += "<p>";
      s += "</html>\r\n\r\n";
      PRINTDEBUG("\nSending 200");
      LED_blink_all(leds,1,CRGB::Purple);
    }
    else if ( req.startsWith("/a?update=") ) {
      http_update_handle(req); //idk what is going on here
      s = "HTTP/1.1 200 OK\r\nContent-Type: text/html\r\n\r\n<!DOCTYPE HTML>\r\n<html>HTTP updated<p>";
      s += String(1);
      s += "</p></html>\r\n\r\n";
    }
    //Responses to time commands
    else if ( req.startsWith("/?SYN") ) { //Sync   //Example: SYN,08+20+2016,09:28:56,1

      commaIndex[0] = req.indexOf(','); //first Index
      commaIndex[1] = req.indexOf(',',commaIndex[0]+1); //next 5 commas
      tm.Month = req.substring(commaIndex[0]+1, commaIndex[0]+3).toInt();
      temp = req.substring(commaIndex[0]+4, commaIndex[0]+6);
      tm.Day = temp.toInt();
      temp = req.substring(commaIndex[0]+9, commaIndex[0]+11);
      tm.Year = temp.toInt(); //years from 2000, set time function needs 2019 or 19.
      temp = req.substring(commaIndex[1]+1, commaIndex[1]+3);
      tm.Hour = temp.toInt();
      temp = req.substring(commaIndex[1]+4, commaIndex[1]+6);
      tm.Minute = temp.toInt();
      temp = req.substring(commaIndex[1]+7, commaIndex[1]+9);
      tm.Second = temp.toInt();
      temp = req.substring(commaIndex[1]+10);
      tm.Wday = temp.toInt();

      /*#if not defined(RTC_DS1307) || defined(RTC_DS3231)
        setTime(tm.Hour,tm.Minute,tm.Second,tm.Day,tm.Month,tm.Year);
      #endif*/
      //run always, not only when no RTC is defined. Helps time library recognize that time is set.
      setTime(tm.Hour,tm.Minute,tm.Second,tm.Day,tm.Month,tm.Year);
      
      #ifdef RTC_DS3231
        Clock.setClockMode(false);  // set to 24h
        Clock.setYear(tm.Year);
        Clock.setMonth(tm.Month);
        Clock.setDate(tm.Day);
        Clock.setDoW(tm.Wday);
        Clock.setHour(tm.Hour);
        Clock.setMinute(tm.Minute);
        Clock.setSecond(tm.Second);
      #endif
      #ifdef RTC_DS1307
        Rtc.SetDateTime(RtcDateTime(tm.Year,tm.Month,tm.Day,tm.Hour,tm.Minute,tm.Second)); //needs year as 2019 or 19
        if (!Rtc.GetIsRunning())
        {
          Rtc.SetIsRunning(true);
        }
      #endif
      
      time_show(clock_face_rotation,0);
      
