Yourigh/A_light/3 - FW SW/2 - Alarm Clock FW ESP8266/_190104_ESP8266_Alight_gitted/src/Alight_main.cpp
      Alarm_shining = false; //turn off alarm after syncing clock

      #if DEBUG == 1
        PRINTDEBUG("\nAlarms from buffer:");
        for (int i=0;i<40;i++){
          if ((i%4)==0) {PRINTDEBUG("\nAlarm #");PRINTDEBUG(1+((i)/4));PRINTDEBUG(":\t");}
          PRINTDEBUG(Alarm_buffer[i]);
          PRINTDEBUG(",\t");
        }
        PRINTDEBUG("\nAlarms from EEPROM:");
        for (int i=0;i<40;i++){
          if ((i%4)==0) {PRINTDEBUG("\nAlarm #");PRINTDEBUG(1+((i)/4));PRINTDEBUG(":\t");}
          PRINTDEBUG(EEPROM.read(i+ALARM_MEMORY_OFFSET));
          PRINTDEBUG(",\t");
        }
      #endif
      
      //if success
      s = buildHTTPResponse(strResponseToSyn);
      PRINTDEBUG("\nSending:");
      PRINTDEBUG(strResponseToSyn);      
    }
    ///////////////////////////////////////////////////////////////////////////////////////////////////////////////
    ////////////////////////////////////////////////////ALARMS/////////////////////////////////////////////////////
    ///////////////////////////////////////////////////////////////////////////////////////////////////////////////
    else if ( req.startsWith("/?ADD") ) { //Example:  /?ADD,2,A,0951,O,0,a      ?ADD,1,A,0825,234,0,name; HTTP/1.1  //234 means monday tuesday and wednesday repetition
      
      Alarm_shining = false; //turn off alarm after adding new or deactivating ANY alarm
      
      //find commas
      commaIndex[0] = req.indexOf(','); //first Index
      for (byte i=1;i<6;i++){
        commaIndex[i] = req.indexOf(',',commaIndex[i-1]+1); //next 5 commas
      }
      byte Alarm_ID = req.substring(commaIndex[0]+1, commaIndex[1]).toInt();  //1 to X
      String Alarm_Active = req.substring(commaIndex[1]+1, commaIndex[2]);    //A or D
      if (Alarm_Active == "A"){   
        delete_alarm(Alarm_ID); //delete previous     
        String Alarm_Repeat = req.substring(commaIndex[3]+1, commaIndex[4]); //o of nothing, numbers for others Sunday=1, to Saturday=7;
        String Alarm_Name = req.substring(commaIndex[5]+1);
        byte Alarm_Sound = req.substring(commaIndex[4]+1, commaIndex[5]).toInt(); //SETTING, alarm sound field only 0 to 2, in app as 1 to 3
        
        Alarm_buffer[(Alarm_ID-1)*4 + 0] = req.substring(commaIndex[2]+1, commaIndex[2]+3).toInt(); //HOUR
        Alarm_buffer[(Alarm_ID-1)*4 + 1] = req.substring(commaIndex[2]+3, commaIndex[3]).toInt(); //MINUTE
        if (Alarm_Repeat == "o"){
          Alarm_buffer[(Alarm_ID-1)*4 + 2] = 0; //no day checkbox was set in app
        } else { 
          if (Alarm_Repeat == "F"){ //all days selected
            Alarm_buffer[(Alarm_ID-1)*4 + 2] = 0b01111111;
          } else {
            byte rep_len = Alarm_Repeat.length();
            Alarm_buffer[(Alarm_ID-1)*4 + 2] = 0;
            for (byte rep_idx=0; rep_idx<rep_len;rep_idx++){
              byte Wday_number = Alarm_Repeat.substring(rep_idx,rep_idx+1).toInt();
              Alarm_buffer[(Alarm_ID-1)*4 + 2] |= 1<<(Wday_number-1); //shift 1 on correct date and then bitwise OR
            }
          }
        }
        Alarm_buffer[(Alarm_ID-1)*4 + 3] = Alarm_Sound+1;
        //Setting, non-zero value means alarm active

        for (int i = 0; i < 4; i++)
        {
          EEPROM.write(ALARM_MEMORY_OFFSET+((Alarm_ID-1)*4)+i, Alarm_buffer[(Alarm_ID-1)*4 + i]);
        }
        EEPROM.commit();
        delay(100);
        PRINTDEBUG("\nAlarm written in EEPROM");
        
        PRINTDEBUG("\nAlarm #");
        PRINTDEBUG(Alarm_ID);
        PRINTDEBUG(" written (Alarm Buffer)");
        PRINTDEBUG("\n\tHour: ");
        PRINTDEBUG(Alarm_buffer[(Alarm_ID-1)*4 + 0]);
        PRINTDEBUG("\n\tMinute: ");
        PRINTDEBUG(Alarm_buffer[(Alarm_ID-1)*4 + 1]);
        PRINTDEBUG("\n\tRepetition: ");
        PRINTDEBUG(Alarm_buffer[(Alarm_ID-1)*4 + 2]);
        PRINTDEBUG("\n\tRepetition BIN: ");
        PRINTDEBUG(Alarm_buffer[(Alarm_ID-1)*4 + 2],BIN);
        PRINTDEBUG("\n\tSetting: ");
        PRINTDEBUG(Alarm_buffer[(Alarm_ID-1)*4 + 3]);
        
      }else{
        PRINTDEBUG("\nNot active - deleting alarm ");
        delete_alarm(Alarm_ID);
      }
      

      
      String responseAdd_w_ID = strResponseToAdd;
      responseAdd_w_ID += Alarm_ID;//Alarm_ID;
      s = buildHTTPResponse(responseAdd_w_ID);
      PRINTDEBUG("\nSending:");
      PRINTDEBUG(responseAdd_w_ID);
      if (Alarm_Active == "A"){
        LED_blink_all(leds,Alarm_ID,CRGB::Green);
      }else{
        LED_blink_all(leds,Alarm_ID,CRGB::Orange);
      }
    }
    else if (req.startsWith("/?DEL") ) { //Example: /?DEL,2 HTTP/1.1
      commaIndex[0] = req.indexOf(','); //first Index
      byte del_ID   = req.substring(commaIndex[0]+1, commaIndex[0]+3).toInt();

      delete_alarm(del_ID);

      Alarm_shining = false; //turn off alarm after deleting ANY alarm
      
      //if success deleting
      s = buildHTTPResponse(strResponseToDel);
      PRINTDEBUG("Sending:");
      PRINTDEBUG(strResponseToDel);
      LED_blink_all(leds,1,CRGB::Orange);
    }
    else if (req.startsWith("/?SET") ) { //Sync   //Example: /?SET,5,Name+SecondWord; HTTP/1.1
      //if success
      s = buildHTTPResponse(strResponseToSet);
      PRINTDEBUG("Sending:");
      PRINTDEBUG(strResponseToSet);
      LED_blink_all(leds,1,CRGB::Green);
    }
    else if (req.startsWith("/?RES") ) { //Reset memory
      //if success
      s = buildHTTPResponse(strResponseToRes);
      PRINTDEBUG("Sending:");
      PRINTDEBUG(strResponseToRes);
      LED_blink_all(leds,1,CRGB::Green);
    }
    else if (req.startsWith("/?DEB") ) { //Debugging screen
      //if success
      s = buildHTTPResponse("Debugging will be here");
      PRINTDEBUG("Sending:");
      PRINTDEBUG(strResponseToRes);
      LED_blink_all(leds,1,CRGB::Green);
    }
    else
    {
      s = buildHTTPResponse("ERR");
      PRINTDEBUG("\nSending ERR");
      LED_blink_all(leds,1,CRGB::Red);
    }
  }
  client.print(s);
  PRINTDEBUG("\nDone with client");
  return OK_VAL;
}

#ifdef NTP_TIME
time_t NTP_time_read(){
  timeClient.update();
  time_t tRTC = (time_t)timeClient.getEpochTime();
  #if DEBUG == 1
    PRINTDEBUG("\nNTC Time read:");
    PRINTDEBUG(tRTC);
  #endif

  if (tRTC < 1608659817) //rudimentary check if time is correct, not older than this code
    {
      PRINTDEBUG("\nNTC Time not valid!");
      return 0;
    }
  else
    setSyncInterval(300); 
    return tRTC;
}
#endif

time_t RTC_time_read(){
  //PRINTDEBUG("RTC read\n");
  #ifdef RTC_DS3231
    tm.Year = Clock.getYear()+30; //offset from 1970
    tm.Month = Clock.getMonth(Century);
    tm.Day = Clock.getDate();
    tm.Wday = Clock.getDoW(); //1-7 Sunday to Saturday
    tm.Hour = Clock.getHour(h12,PM); //24h = false, AM/PM thing for 12h does not matter
    tm.Minute = Clock.getMinute();
    tm.Second = Clock.getSecond();
  #endif
  #ifdef RTC_DS1307
    RtcDateTime ttime;
    ttime = Rtc.GetDateTime();
    tm.Year = (uint8_t)(ttime.Year()-1970);
    tm.Month = ttime.Month();
    tm.Day = ttime.Day();
    tm.Wday = ttime.DayOfWeek()+1; //1-7 Sunday to Saturday
    tm.Hour = ttime.Hour();
    tm.Minute = ttime.Minute();
    tm.Second = ttime.Second();
  #endif

  time_t tRTC = makeTime(tm);
  if (tRTC < 1608661255) //rudimentary check if time is correct, not older than this code
    {return 0;
    PRINTDEBUG("\nRTC Time not valid!");
    return 0;}
  else
    return tRTC;
}


bool check_alarm(){ //need to be run at least every 60 seconds (time of alarm have to match exactly on hour,minute and Wday)
  if (Alarm_shining == true){
    //PRINTDEBUG("\nAlarm timeout in: \t");PRINTDEBUG((ALARM_TIMEOUT_MS - (millis() - alarm_timeout_from_ms))/1000);PRINTDEBUG(" s");
    if (millis() - alarm_timeout_from_ms > ALARM_TIMEOUT_MS){
      Alarm_shining = false; //timeout happened
      LED_blink_all(leds,20,CRGB::Blue);
      //turn off external light. 
      //this will not work if only "1" position is on - then it will tirn it on full
      //will work in all other cases
      ext_trigger(PIN_TRG_KEY1);
      delay(3000);
      ext_trigger(PIN_TRG_ONOFF);
      return false;
    }
    return true; //alarm is already ON
  }
  breakTime(now(),tm);
  for (byte al_idx=0;al_idx<10;al_idx++){
    if (Alarm_buffer[(al_idx*4)+3] != 0){
      if (  (  (Alarm_buffer[(al_idx*4)+2])  &  (1<<(tm.Wday-1))  )||(Alarm_buffer[(al_idx*4)+2]==0) ){ 
                //shift 1 to correct position, then bitwise AND.. normal OR zero in alarm wday (no day ticked)
        //today IS an alarm weekday OR weekdays are not set
        //is the alarm time?
        if ((tm.Hour == Alarm_buffer[(al_idx*4)+0]) && (tm.Minute == Alarm_buffer[(al_idx*4)+1])){
          Alarm_shining = true; //so it will not go off after THE minute passes
          alarm_timeout_from_ms = millis()-(1000*tm.Second);//time when alarm was activated (for timeout)
          return true;
        }
      }
    }
  }
  return false;
}

void delete_alarm(byte Alarm_ID){
  for (byte del_idx=0;del_idx<4;del_idx++){
    Alarm_buffer[(Alarm_ID-1)*4 + del_idx] = 0;
    EEPROM.write(ALARM_MEMORY_OFFSET+((Alarm_ID-1)*4)+del_idx, 0);
  }
  EEPROM.commit();
}

byte getOrientation(void)
{
  // accel.readPL() will return a byte containing information
  // about the orientation of the sensor. It will be either
  // PORTRAIT_U, PORTRAIT_D, LANDSCAPE_R, LANDSCAPE_L, or
  // LOCKOUT.
  byte pl = accel.readPL();
  switch (pl)
  {
  case PORTRAIT_U:
    //Serial.print("Portrait Up"); //00
    return 0; 
    break;
  case PORTRAIT_D:
    //Serial.print("Portrait Down"); //02
    return 2;
    break;
  case LANDSCAPE_R:
    //Serial.print("Landscape Right"); //01
    return 1;
    break;
  case LANDSCAPE_L:
    //Serial.print("Landscape Left"); //03
    return 3;
    break;
  case LOCKOUT:
    //Serial.print("Flat");
    return 0;
    break;
  }
  return 0;
}

////////////////////////////////////////////////////
///////////////////DEBUG////////////////////////////
////////////////////////////////////////////////////
#if DEBUG == 1

#endif

void loop() {
  //nothing
}
